#### Terraform Format and Style 🖌
`success`

#### Terraform Initialization ⚙️
`success`

#### Terraform Validation 🤖
Success! The configuration is valid.



#### Terraform Plan 📖
`success`

<details><summary>Show Plan</summary>

```terraform\nRefreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

null_resource.test2: Refreshing state... [id=5796609601267474659]
null_resource.test: Refreshing state... [id=2936362397567710328]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.sentry_key.web will be read during apply
  # (config refers to values not yet known)
 <= data "sentry_key" "web"  {
      + dsn_csp           = (known after apply)
      + dsn_public        = (known after apply)
      + dsn_secret        = (known after apply)
      + id                = (known after apply)
      + is_active         = (known after apply)
      + name              = "Default"
      + organization      = "cicd-demo"
      + project           = "web-app"
      + project_id        = (known after apply)
      + public            = (known after apply)
      + rate_limit_count  = (known after apply)
      + rate_limit_window = (known after apply)
      + secret            = (known after apply)
    }

  # sentry_project.web will be created
  + resource "sentry_project" "web" {
      + color             = (known after apply)
      + digests_max_delay = (known after apply)
      + digests_min_delay = (known after apply)
      + features          = (known after apply)
      + id                = (known after apply)
      + is_bookmarked     = (known after apply)
      + is_public         = (known after apply)
      + name              = "Web App"
      + organization      = "cicd-demo"
      + platform          = "javascript"
      + project_id        = (known after apply)
      + resolve_age       = 720
      + slug              = "web-app"
      + status            = (known after apply)
      + team              = "web"
    }

  # sentry_team.web will be created
  + resource "sentry_team" "web" {
      + has_access   = (known after apply)
      + id           = (known after apply)
      + is_member    = (known after apply)
      + is_pending   = (known after apply)
      + name         = "Web Team"
      + organization = "cicd-demo"
      + slug         = "web"
      + team_id      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sentry_web_project_id             = (known after apply)
  + sentry_web_project_key_dsn_public = (known after apply)

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"

```

</details>